# 1. Extract

In [1]:
import pandas as pd
person = pd.read_csv("Persons.csv")

In [2]:
#anschauen....
person

      Name Geschlecht  Alter   Nationalität  Gehalt City-ID
0    Peter          M     34        deutsch    3400       B
1    Karla          W     43  schweizerisch    4000      AC
2     Anne          W     16        deutsch       0       B
3     Nino          M     22    italienisch    3000      HB
4  Andrzej          M     61       polnisch    2300      KS
5  Flurina          W     65  schweizerisch    6000      HB

In [3]:
wohnort = pd.read_csv("Cities.csv")

In [4]:
#anschauen...
wohnort

  Wohnort Stadt-ID
0  Kassel       KS
1  Berlin        B
2  Aachen       AC
3  Bremen       HB

# 2. Transform
## 2.1 Zusammenführen zweier Tabellen

In [5]:
dataframe = person.merge(right=wohnort, how='left', left_on='City-ID', right_on='Stadt-ID')

In [6]:
dataframe

      Name Geschlecht  Alter   Nationalität  Gehalt City-ID Wohnort Stadt-ID
0    Peter          M     34        deutsch    3400       B  Berlin        B
1    Karla          W     43  schweizerisch    4000      AC  Aachen       AC
2     Anne          W     16        deutsch       0       B  Berlin        B
3     Nino          M     22    italienisch    3000      HB  Bremen       HB
4  Andrzej          M     61       polnisch    2300      KS  Kassel       KS
5  Flurina          W     65  schweizerisch    6000      HB  Bremen       HB

In [ ]:
#Iteration
for index, row in dataframe.iterrows():
    print(str(index)+' : '+row['Name']+'/'+str(row['Alter']))

## 2.2 Änderungen an Daten (z.B. für Korrekturen)

In [ ]:
#Manipulation eines df mit "at[Zeile, Spalte]" funktioniert
dataframe.at[0, 'Name'] = "Rolf"
#Aus Peter wird Rolf

In [ ]:
dataframe

## 2.3 Verändern der Daten (...ab 50 ist man "alt")

In [ ]:
for index, row in dataframe.iterrows():
    if (int(row["Alter"]) > 50):
        dataframe.at[index, "Altersklasse"] = "alt"
    else:
        dataframe.at[index, "Altersklasse"] = "jung"
dataframe

## 2.4 Nur bestimmte Spalten ausgeben (Projektion)

In [ ]:
# schöne Ausgabe:
ausgabe = dataframe[['Name', 'Geschlecht', 'Alter', 'Altersklasse', 'Nationalität', 'Gehalt', 'Wohnort']]
ausgabe

## 2.5 Nur bestimmte Zeilen ausgeben 
### (Selektion mit logischen Operatoren wie '=', '&', '<', usw.)

In [ ]:
#Abfrage / Selektion: "Gib alle alten aus":
alte = ausgabe[ausgabe['Altersklasse']=='alt']
alte

In [ ]:
#Abfrage / Selektion: "Gib alle Schweizer aus":
schweizer = ausgabe[(ausgabe['Nationalität']=='schweizerisch')]
schweizer

In [ ]:
#Abfrage / Selektion: "Gib alle alten Schweizer aus":
alteschweizer = ausgabe[(ausgabe['Altersklasse']=='alt') & (ausgabe['Nationalität']=='schweizerisch')]
alteschweizer

In [ ]:
# .... wobei das alte ∩ schweizer auch einfacher geht: 
alte.merge(schweizer)